In [1]:
import pandas as pd

In [2]:
two_dimensional_list = [['dongwook', 50, 86], ['sineui', 89, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]

In [5]:
my_df = pd.DataFrame(two_dimensional_list, columns=['name', 'english_score', 'math_score'], index=['a', 'b', 'c', 'd'])
my_df

       name  english_score  math_score
a  dongwook             50          86
b    sineui             89          31
c   ikjoong             68          91
d   yoonsoo             88          75

In [6]:
type(my_df)

pandas.core.frame.DataFrame

In [8]:
my_df.columns

Index(['name', 'english_score', 'math_score'], dtype='object')

In [9]:
my_df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
my_df.dtypes

name             object
english_score     int64
math_score        int64
dtype: object

In [11]:
readfile_df = pd.read_csv('data/liverpool.csv')

In [12]:
readfile_df

              Name Position  Born  Number Nationality
0  Roberto Firmino       FW  1991   no. 9      Brazil
1       Sadio Mane       FW  1992  no. 10     Senegal
2    Mohamed Salah       FW  1992  no. 11       Egypt
3        Joe Gomez       DF  1997  no. 12     England
4   Alisson Becker       GK  1992  no. 13      Brazil

In [13]:
readfile2_df = pd.read_csv('data/liverpool.csv', index_col=0)

In [14]:
readfile2_df

                Position  Born  Number Nationality
Name
Roberto Firmino       FW  1991   no. 9      Brazil
Sadio Mane            FW  1992  no. 10     Senegal
Mohamed Salah         FW  1992  no. 11       Egypt
Joe Gomez             DF  1997  no. 12     England
Alisson Becker        GK  1992  no. 13      Brazil

In [16]:
readfile_df.loc[0, 'Born']

1991

In [17]:
readfile_df.loc[0, :]

Name           Roberto Firmino
Position                    FW
Born                      1991
Number                   no. 9
Nationality             Brazil
Name: 0, dtype: object

In [18]:
type(readfile_df.loc[0, :])

pandas.core.series.Series

In [19]:
readfile_df.loc[:, 'Name']

0    Roberto Firmino
1         Sadio Mane
2      Mohamed Salah
3          Joe Gomez
4     Alisson Becker
Name: Name, dtype: object

In [21]:
readfile_df['Name']

0    Roberto Firmino
1         Sadio Mane
2      Mohamed Salah
3          Joe Gomez
4     Alisson Becker
Name: Name, dtype: object

In [22]:
type(readfile_df['Name'])

pandas.core.series.Series